from yandex_testing_lesson import is_correct_mobile_phone_number_ru


def main():
    tests = [
        # Корректные номера
        ("8(900)1234567", True),
        ("+7(900)1234567", True),
        ("+7 900 1234567", True),
        ("8 900 1234567", True),
        ("+7(900) 123-45-67", True),
        ("+7 900 123-45-67", True),
        ("8-900-123-45-67", True),
        ("+7 (900) 123 45 67", True),
        # Некорректные номера
        ("7(900)1234567", False),  # номер не начинается с 8 или +7
        ("+8(900)1234567", False),  # номер не начинается с +7
        ("8(90)1234567", False),  # код оператора меньше трех цифр
        ("8(9000)1234567", False),  # код оператора больше трех цифр
        ("8(900)123456", False),  # меньше 7 цифр после кода оператора
        ("+7(900)12345678", False),  # больше 7 цифр после кода оператора
        ("+7(900)12a4567", False),  # присутствуют недопустимые символы
        ("+7(9001234567", False),  # отсутствует закрывающая скобка
    ]

    for number, expected in tests:
        if is_correct_mobile_phone_number_ru(number) != expected:
            print("NO")
            return
    print("YES")


if __name__ == "__main__":
    main()
